Revit 2026 API

# PointCloudFilterUtils Class

---

Utilities specific to point cloud filters.

SystemObject Autodesk.Revit.DB.PointCloudsPointCloudFilterUtils

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PointCloudFilterUtils
```
```vb
Public NotInheritable Class PointCloudFilterUtils
```
```cpp
public ref class PointCloudFilterUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointCloudFilterUtils = class end
```

The PointCloudFilterUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFilteredOutline | Computes outline of a part of a box that satisfies given PointCloudFilter. |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace